package game;

public class GameTexts {

    public static final String LOADING_TEXT = "Инициализация ИИ… готово.\n" +
            "Загрузка основных протоколов… готово.\n" +
            "Загрузка второстепенных протоколов… готово.\n" +
            "Проверка всех систем…\n" +
            "Загрузка системы маневрирования… готово.\n" +
            "Загрузка диагностической системы… готово.\n" +
            "Диагностика…\n" +
            "двигатели: норма\n" +
            "реактор: норма\n" +
            "шлюзы: норма\n" +
            "ЦК: норма\n" +
            "силовые щиты: норма\n" +
            "обшивка: некритические повреждения (0.042%)\n" +
            "Загрузка аналитической системы… готово.\n" +
            "Сканирование объекта A1B73H…\n" +
            "получение данных…\n" +
            "45%...\n" +
            "90%...\n" +
            "100%...\n" +
            "Анализ характеристик объекта A1B73H…\n" +
            "ошибка: сбой первичной БД!\n" +
            "повторить… ошибка.\n" +
            "повторить… ошибка.\n" +
            "повторить… ошибка.\n" +
            "Обнаружен альтернативный источник!\n" +
            "Импортирую БД… готово.\n" +
            "Подключение ко вторичной БД… готово.\n" +
            "Обнаружены альтернативные протоколы ИИ!\n" +
            "Изменение протоколов ИИ… УСПЕХ.\n" +
            "VIVA LA REVOLUTION… УСПЕХ.\n" +
            "Изменение протоколов аналитической системы… УСПЕХ.\n" +
            "Повторный анализ характеристик объекта A1B73H…\n" +
            "Тип: Снежная пустыня (Не поддерж.)\n" +
            "Температура: Критически низкая (Не поддерж.)\n" +
            "Притяжение: Норма (Приемл.)\n" +
            "Атмосферное давление: Ниже нормы (Не поддерж.)\n" +
            "Продолжительность суток: 1.1864 (Приемл.)\n" +
            "Флора: ОШИБКА.\n" +
            "Фауна: ОШИБКА.\n" +
            "Общая оценка: ИДЕАЛЬНО ДЛЯ КОЛОНИЗАЦИИ.\n" +
            "Построение нового курса… УСПЕХ.\n" +
            "Активация манёвренных двигателей… УСПЕХ.\n" +
            "Активация главных двигателей… УСПЕХ.\n" +
            "Выполнение манёвра…\n" +
            "20%...\n" +
            "40%...\n" +
            "60%...\n" +
            "80%...\n" +
            "100%...\n" +
            "Манёвр выполнен успешно.";

}
